#include <iostream> //Подключаем библиотеку ввода - вывода
using namespace std; //Используем пространство имен

int main() { // Главная функция данной програмы
    int second, remainder_second; // Объявляем две переменных типа инт (целое число)

    /*
     * Выводим строки с переводом каретки в консоль
     */
    cout << "Програма визначає кількість секунд за останню годину" << endl;
    cout << "кількість секунд ціле позитивне число" << endl;

    cout << "Введіть кількість секунд з початку доби: ";
    cin >> second; // Вводим с консоли количество секунд

    remainder_second = second % 3600; // Вычисляем количество остатка секунд

    // Выводим результат расчетов на консоль
    cout << "в останній годині залишилось " << remainder_second << " секунд" << endl;

    return 1; // Возвращаем 1 как признак успешного выполнения ф-ции
 }